exercises-1.1.org
#+TITLE: SICP Exercise Solutions for Section 1.1
#+AUTHOR: Paul L. Snyder
#+EMAIL: paul@pataprogramming.com
#+TODO: TODO(t) WRITEUP(w) || (d)

* Section 1.1.6
** Exercise 1.1: Interpreting expressions
*** Problem
     Below is a sequence of expressions.  What is the
     result printed by the interpreter in response to each expression?
     Assume that the sequence is to be evaluated in the order in which
     it is presented.

#+BEGIN_SRC scheme :results silent
  10
  (+ 5 3 4)
  (- 9 1)
  (/ 6 2)
  (+ (* 2 4) (- 4 6))
  (define a 3)
  (define b (+ a 1))
  (+ a b (* a b))
  (= a b)
  (if (and (> b a) (< b (* a b)))
      b
      a)
  (cond ((= a 4) 6)
        ((= b 4) (+ 6 7 a))
        (else 25))
  (+ 2 (if (> b a) b a))
  (* (cond ((> a b) a)
           ((< a b) b)
           (else -1))
     (+ a 1))
#+END_SRC

*** Answer

#+BEGIN_EXAMPLE
> 10
10
> (+ 5 3 4)
12
> (- 9 1)
8
> (/ 6 2)
3
> (+ (* 2 4) (- 4 6))
-16
> (define a 3)
> (define b (+ a 1))
> (+ a b (* a b))
19
> (= a b)
#f
> (if (and (> b a) (< b (* a b)))
      b
      a)
4
> (cond ((= a 4) 5)
        ((= b 4) (+ 6 7 a)))
16
#+END_EXAMPLE

** Exercise 1.2: Translating to prefix notation

     Translate the following expression into prefix form.

     $$\frac{5 + 4 + ( 2 - (3 = (6 + \frac{4}{5})))}{3 (6 - 2)(2 - 7)}$$

#+BEGIN_SRC scheme :results value
(/ (+ 5 4 (- 2 (- 3 (+ 6 (/ 4 5)))))
   (* 3 (- 6 2) (- 2 7)))
#+END_SRC

#+RESULTS:
: -37/150

** Exercise 1.3: Summing the squares of two larger numbers
*** Problem

    Define a procedure that takes three numbers as arguments and
    returns the sum of the squares of the two larger numbers.

*** Answer

#+BEGIN_SRC scheme :results silent

  (define (square a) (* a a))

  (define (sum-of-squares a b) (+ (square a) (square b)))

  (define (sum-of-squares-of-larger-two a b c)
    (cond
     ((and (<= a b) (<= a c))  (sum-of-squares b c))
     ((and (<= b a) (<= b c))  (sum-of-squares a c))
     (else                     (sum-of-squares a b))))

  (define (sum-of-squares-of-larger-two-alt a b c)
    (if (>= a b)
        (if (>= b c)    ; we know a is in, as it's at least as large
                        ; as one other number
            (sum-of-squares a b)     ; c is out
            (sum-of-squares a c))    ; b is out
        (if (>= a c)    ; we know b is in for this branch, since
                        ;it's strictly larger than a
            (sum-of-squares b a)     ; c is out
            (sum-of-squares b c))))  ; a is out

  ;; This can be made even shorter by exploiting the return value of if
  (define (sum-of-squares-of-larger-two-altalt a b c)
    (if (>= a b)
        (sum-of-squares a (if (>= b c) b c))
        (sum-of-squares b (if (>= a c) a c))))
#+END_SRC

** Exercise 1.4: Evaluating combinations
*** Problem
     Observe that our model of evaluation allows for combinations
     whose operators are compound expressions.  Use this observation
     to describe the behavior of the following procedure:

#+BEGIN_SRC scheme
  (define (a-plus-abs-b a b)
    ((if (> b 0) + -) a b))
#+END_SRC

*** Answer

When the expression containing the =if= operator is evaluated, if =b=
is strictly larger than 0, the expression returns =+=, which is used
as the operator for the containing expression, adding =a= and
=b=. Otherwise, the =if= returns =-=, subtracting =b= from =a=; since
=b= is negative in this case (or 0) this increases the value by the
same amount as it would have increased were =b= to be positive.

** Exercise 1.5: Applicative order vs normal order
