exercises-1.1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>SICP Exercise Solutions for Section 1.1</title>
<!-- 2014-03-30 Sun 19:30 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Paul L. Snyder" />
</head>
<body>
<div id="content">
<h1 class="title">SICP Exercise Solutions for Section 1.1</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Section 1.1.6</a>
<ul>
<li><a href="#sec-1-1">1.1. Exercise 1.1: Interpreting expressions</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. Problem</a></li>
<li><a href="#sec-1-1-2">1.1.2. Answer</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2. Exercise 1.2: Translating to prefix notation</a></li>
<li><a href="#sec-1-3">1.3. Exercise 1.3: Summing the squares of two larger numbers</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1. Problem</a></li>
<li><a href="#sec-1-3-2">1.3.2. Answer</a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4. Exercise 1.4: Evaluating combinations</a>
<ul>
<li><a href="#sec-1-4-1">1.4.1. Problem</a></li>
<li><a href="#sec-1-4-2">1.4.2. Answer</a></li>
</ul>
</li>
<li><a href="#sec-1-5">1.5. Exercise 1.5: Applicative order vs normal order</a>
<ul>
<li><a href="#sec-1-5-1">1.5.1. Problem</a></li>
<li><a href="#sec-1-5-2">1.5.2. Answer</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2">2. Section 1.1.7</a>
<ul>
<li><a href="#sec-2-1">2.1. Exercise 1.6: <code>if</code> and the reason for special forms</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1. Problem</a></li>
<li><a href="#sec-2-1-2">2.1.2. Answer</a></li>
</ul>
</li>
<li><a href="#sec-2-2">2.2. Exercise 1.7: When <code>good-enough?</code> is not good enough</a>
<ul>
<li><a href="#sec-2-2-1">2.2.1. Problem</a></li>
<li><a href="#sec-2-2-2">2.2.2. Answer</a></li>
</ul>
</li>
<li><a href="#sec-2-3">2.3. Exercise 1.8</a>
<ul>
<li><a href="#sec-2-3-1">2.3.1. Problem</a></li>
<li><a href="#sec-2-3-2">2.3.2. Answer</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Section 1.1.6</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Exercise 1.1: Interpreting expressions</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> Problem</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Below is a sequence of expressions.  What is the
result printed by the interpreter in response to each expression?
Assume that the sequence is to be evaluated in the order in which
it is presented.
</p>

<div class="org-src-container">

<pre class="src src-scheme">10
(+ 5 3 4)
(- 9 1)
(/ 6 2)
(+ (* 2 4) (- 4 6))
(define a 3)
(define b (+ a 1))
(+ a b (* a b))
(= a b)
(if (and (&gt; b a) (&lt; b (* a b)))
    b
    a)
(cond ((= a 4) 6)
      ((= b 4) (+ 6 7 a))
      (else 25))
(+ 2 (if (&gt; b a) b a))
(* (cond ((&gt; a b) a)
         ((&lt; a b) b)
         (else -1))
   (+ a 1))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> Answer</h4>
<div class="outline-text-4" id="text-1-1-2">
<pre class="example">
&gt; 10
10
&gt; (+ 5 3 4)
12
&gt; (- 9 1)
8
&gt; (/ 6 2)
3
&gt; (+ (* 2 4) (- 4 6))
-16
&gt; (define a 3)
&gt; (define b (+ a 1))
&gt; (+ a b (* a b))
19
&gt; (= a b)
#f
&gt; (if (and (&gt; b a) (&lt; b (* a b)))
      b
      a)
4
&gt; (cond ((= a 4) 5)
        ((= b 4) (+ 6 7 a)))
16
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Exercise 1.2: Translating to prefix notation</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Translate the following expression into prefix form.
</p>

<p>
$$\frac{5 + 4 + ( 2 - (3 = (6 + \frac{4}{5})))}{3 (6 - 2)(2 - 7)}$$
</p>

<div class="org-src-container">

<pre class="src src-scheme">(/ (+ 5 4 (- 2 (- 3 (+ 6 (/ 4 5)))))
   (* 3 (- 6 2) (- 2 7)))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Exercise 1.3: Summing the squares of two larger numbers</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> Problem</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
Define a procedure that takes three numbers as arguments and
returns the sum of the squares of the two larger numbers.
</p>
</div>
</div>
<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> Answer</h4>
<div class="outline-text-4" id="text-1-3-2">
<div class="org-src-container">

<pre class="src src-scheme">(define (square a) (* a a))

(define (sum-of-squares a b) (+ (square a) (square b)))

(define (sum-of-squares-of-larger-two a b c)
  (cond
   ((and (&lt;= a b) (&lt;= a c))  (sum-of-squares b c))
   ((and (&lt;= b a) (&lt;= b c))  (sum-of-squares a c))
   (else                     (sum-of-squares a b))))

(define (sum-of-squares-of-larger-two-alt a b c)
  (if (&gt;= a b)
      (if (&gt;= b c)    ; we know a is in, as it's at least as large
                      ; as one other number
          (sum-of-squares a b)     ; c is out
          (sum-of-squares a c))    ; b is out
      (if (&gt;= a c)    ; we know b is in for this branch, since
                      ;it's strictly larger than a
          (sum-of-squares b a)     ; c is out
          (sum-of-squares b c))))  ; a is out

;; This can be made even shorter by exploiting the return value of if
(define (sum-of-squares-of-larger-two-altalt a b c)
  (if (&gt;= a b)
      (sum-of-squares a (if (&gt;= b c) b c))
      (sum-of-squares b (if (&gt;= a c) a c))))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Exercise 1.4: Evaluating combinations</h3>
<div class="outline-text-3" id="text-1-4">
</div><div id="outline-container-sec-1-4-1" class="outline-4">
<h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span> Problem</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
Observe that our model of evaluation allows for combinations
whose operators are compound expressions.  Use this observation
to describe the behavior of the following procedure:
</p>

<div class="org-src-container">

<pre class="src src-scheme">(define (a-plus-abs-b a b)
  ((if (&gt; b 0) + -) a b))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-4-2" class="outline-4">
<h4 id="sec-1-4-2"><span class="section-number-4">1.4.2</span> Answer</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
When the expression containing the <code>if</code> operator is evaluated, if <code>b</code>
is strictly larger than 0, the expression returns <code>+</code>, which is used
as the operator for the containing expression, adding <code>a</code> and
<code>b</code>. Otherwise, the <code>if</code> returns <code>-</code>, subtracting <code>b</code> from <code>a</code>; since
<code>b</code> is negative in this case (or 0) this increases the value by the
same amount as it would have increased were <code>b</code> to be positive.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Exercise 1.5: Applicative order vs normal order</h3>
