exercises-1.1.tex
% Created 2014-03-09 Sun 17:53
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\author{Plant Kingdom}
\date{\today}
\title{exercises-1.1}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.3.50.1 (Org mode 8.2.5h)}}
\begin{document}

\maketitle
\tableofcontents

\section{Section 1.1}
\label{sec-1}
\subsection{Section 1.1.6}
\label{sec-1-1}
\subsubsection{Exercise 1.1: Interpreting expressions}
\label{sec-1-1-1}
\begin{enumerate}
\item Problem
\label{sec-1-1-1-1}
Below is a sequence of expressions.  What is the
result printed by the interpreter in response to each expression?
Assume that the sequence is to be evaluated in the order in which
it is presented.

\begin{verbatim}
10
(+ 5 3 4)
(- 9 1)
(/ 6 2)
(+ (* 2 4) (- 4 6))
(define a 3)
(define b (+ a 1))
(+ a b (* a b))
(= a b)
(if (and (> b a) (< b (* a b)))
    b
    a)
(cond ((= a 4) 6)
      ((= b 4) (+ 6 7 a))
      (else 25))
(+ 2 (if (> b a) b a))
(* (cond ((> a b) a)
         ((< a b) b)
         (else -1))
   (+ a 1))
\end{verbatim}
\item Answer
\label{sec-1-1-1-2}

\begin{verbatim}
> 10
10
> (+ 5 3 4)
12
> (- 9 1)
8
> (/ 6 2)
3
> (+ (* 2 4) (- 4 6))
-16
> (define a 3)
> (define b (+ a 1))
> (+ a b (* a b))
19
> (= a b)
#f
> (if (and (> b a) (< b (* a b)))
      b
      a)
4
> (cond ((= a 4) 5)
        ((= b 4) (+ 6 7 a)))
16
\end{verbatim}
\end{enumerate}
\subsubsection{Exercise 1.2: Translating to prefix notation}
\label{sec-1-1-2}

Translate the following expression into prefix form.

$$\frac{5 + 4 + ( 2 - (3 = (6 + \frac{4}{5})))}{3 (6 - 2)(2 - 7)}$$

\begin{verbatim}
(/ (+ 5 4 (- 2 (- 3 (+ 6 (/ 4 5)))))
   (* 3 (- 6 2) (- 2 7)))
\end{verbatim}
\subsubsection{Exercise 1.3: Summing the squares of two larger numbers}
\label{sec-1-1-3}
\begin{enumerate}
\item Problem
\label{sec-1-1-3-1}

Define a procedure that takes three numbers as arguments and
returns the sum of the squares of the two larger numbers.
\item Answer
\label{sec-1-1-3-2}

\begin{verbatim}
(define (square a) (* a a))

(define (sum-of-squares a b) (+ (square a) (square b)))

(define (sum-of-squares-of-larger-two a b c)
  (cond
   ((and (<= a b) (<= a c))  (sum-of-squares b c))
   ((and (<= b a) (<= b c))  (sum-of-squares a c))
   (else                     (sum-of-squares a b))))

(define (sum-of-squares-of-larger-two-alt a b c)
  (if (>= a b)
      (if (>= b c)    ; we know a is in, as it's at least as large
                      ; as one other number
          (sum-of-squares a b)     ; c is out
          (sum-of-squares a c))    ; b is out
      (if (>= a c)    ; we know b is in for this branch, since
                      ;it's strictly larger than a
          (sum-of-squares b a)     ; c is out
          (sum-of-squares b c))))  ; a is out

;; This can be made even shorter by exploiting the return value of if
(define (sum-of-squares-of-larger-two-altalt a b c)
  (if (>= a b)
      (sum-of-squares a (if (>= b c) b c))
      (sum-of-squares b (if (>= a c) a c))))
\end{verbatim}
\end{enumerate}
\subsubsection{Exercise 1.4: Evaluating combinations}
\label{sec-1-1-4}
\begin{enumerate}
\item Problem
\label{sec-1-1-4-1}
Observe that our model of evaluation allows for combinations
whose operators are compound expressions.  Use this observation
to describe the behavior of the following procedure:

\begin{verbatim}
(define (a-plus-abs-b a b)
  ((if (> b 0) + -) a b))
\end{verbatim}
\item Answer
\label{sec-1-1-4-2}

When the expression containing the \texttt{if} operator is evaluated, if \texttt{b}
is strictly larger than 0, the expression returns \texttt{+}, which is used
as the operator for the containing expression, adding \texttt{a} and
\texttt{b}. Otherwise, the \texttt{if} returns \texttt{-}, subtracting \texttt{b} from \texttt{a}; since
\texttt{b} is negative in this case (or 0) this increases the value by the
same amount as it would have increased were \texttt{b} to be positive.
\end{enumerate}
\subsubsection{Exercise 1.5: Applicative order vs normal order}
\label{sec-1-1-5}
\begin{enumerate}
\item Problem
\label{sec-1-1-5-1}
