exercises-1.1.org
*** Problem
     Ben Bitdiddle has invented a test to determine whether the
     interpreter he is faced with is using applicative-order
     evaluation or normal-order evaluation.  He defines the following
     two procedures:

#+BEGIN_SRC scheme :output silent
          (define (p) (p))

          (define (test x y)
            (if (= x 0)
                0
                y))
#+END_SRC

     Then he evaluates the expression

#+BEGIN_EXAMPLE
          (test 0 (p))
#+END_EXAMPLE

     What behavior will Ben observe with an interpreter that uses
     applicative-order evaluation?  What behavior will he observe with
     an interpreter that uses normal-order evaluation?  Explain your
     answer.  (Assume that the evaluation rule for the special form
     `if' is the same whether the interpreter is using normal or
     applicative order: The predicate expression is evaluated first,
     and the result determines whether to evaluate the consequent or
     the alternative expression.)

*** Answer

The procedure =p= will cause an infinitely recursive loop if
executed. If Ben is using an applicative-order interpreter, the
operands will be evaluated first, and the command will enter the loop.
If the interpreter is normal order, the value of the operands will not
be resolved immediately. Instead, test will be executed. =x= will be
resolved in the predicate of the =if=, which succeeds. As the consequent
branch is followed, =y= will never be evaluated, and thus =p= will never
be executed.

To clarify the difference between normal and applicative order,
consider nested applications of the =sq= procedure:

#+BEGIN_SRC
(define (sq n) (* n n)
(sq (sq (sq (+ 1 1))))
#+END_SRC

Suppose this is evaluated in normal order (combining some of the
expansion steps to save space):

#+BEGIN_SRC
1> (sq (sq (sq (+ 1 1))))
2> (* (sq (sq (+ 1 1)))
      (sq (sq (+ 1 1))))
3> (* (* (sq (+ 1 1))
         (sq (+ 1 1))
      (* (sq (+ 1 1))
         (sq (+ 1 1)))
4> (* (* (* (+ 1 1) (+ 1 1))
         (* (+ 1 1) (+ 1 1)))
      (* (* (+ 1 1) (+ 1 1))
         (* (+ 1 1) (+ 1 1))))
5> (* (* (* 2 2) (* 2 2))
      (* (* 2 2) (* 2 2)))
6> (* (* 4 4) (* 4 4)
7> (* 16 16)
8> 256
#+END_SRC

As can be seen, none of the "leaf" additions are evaluated until
everything is expanded, so there are eight individual addition and
seven multiplication operations performed (as seen in steps 4 through
7). Compare this to an applicative-order evaluation:

#+BEGIN_SRC
1> (sq (sq (sq (+ 1 1))))
2> (sq (sq (sq 2)))
3> (sq (sq (* 2 2)))
4> (sq (sq 4))
5> (sq (* 4 4))
6> (sq 16)
7> (* 16 16)
8> 256
#+END_SRC

Only a single addition and three multiplications need to be performed!

* Section 1.1.7
** Exercise 1.6: =if= and the reason for special forms
*** Problem

     Alyssa P. Hacker doesn't see why =if= needs to be
     provided as a special form.  "Why can't I just define it as an
     ordinary procedure in terms of =cond?=," she asks.  Alyssa's friend
     Eva Lu Ator claims this can indeed be done, and she defines a new
     version of =if=:

#+BEGIN_SRC scheme :results silent
  (define (new-if predicate then-clause else-clause)
    (if predicate
        then-clause
        else-clause))
#+END_SRC

     Eva demonstrates the program for Alyssa:

#+BEGIN_EXAMPLE
  (new-if (= 2 3) 0 5)
  5

  (new-if (= 1 1) 0 5)
  0
#+END_EXAMPLE

     Delighted, Alyssa uses =new-if= to rewrite the square-root program:

#+BEGIN_SRC scheme :results silent
  (define (sqrt-iter guess x)
    (new-if (good-enough? guess x)
            guess
            (sqrt-iter (improve guess x)
                       x)))

  (sqrt-iter 1 4)

  (if true
          guess
          (sqrt-iter (improve guess x)
                     x))


  (new-if true
          guess
          (sqrt-iter (improve guess x)
                     x))
  (new-if (good-enough? guess x)
          guess
          (new-if (good-enough? guess x)
                  guess
                  (sqrt-iter (improve guess x)
                             x)))


#+END_SRC

     What happens when Alyssa attempts to use this to compute square
     roots?  Explain.

*** Answer

In =sqrt-iter=, before =new-if= is called, the arguments are evaluated
in applicative order. This includes the recursive call to
itself. Thus, even when the good-enough? termination condition is
satisfied, the recursion will continue, resulting in an infinite
recursion.

** Exercise 1.7: When =good-enough?= is not good enough
