exercises-1.1.html
<div class="outline-text-3" id="text-1-5">
</div><div id="outline-container-sec-1-5-1" class="outline-4">
<h4 id="sec-1-5-1"><span class="section-number-4">1.5.1</span> Problem</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
Ben Bitdiddle has invented a test to determine whether the
interpreter he is faced with is using applicative-order
evaluation or normal-order evaluation.  He defines the following
two procedures:
</p>

<pre class="example">
(define (p) (p))

(define (test x y)
  (if (= x 0)
      0
      y))
</pre>

<p>
Then he evaluates the expression
</p>

<pre class="example">
(test 0 (p))
</pre>

<p>
What behavior will Ben observe with an interpreter that uses
applicative-order evaluation?  What behavior will he observe with
an interpreter that uses normal-order evaluation?  Explain your
answer.  (Assume that the evaluation rule for the special form
`if' is the same whether the interpreter is using normal or
applicative order: The predicate expression is evaluated first,
and the result determines whether to evaluate the consequent or
the alternative expression.)
</p>
</div>
</div>
<div id="outline-container-sec-1-5-2" class="outline-4">
<h4 id="sec-1-5-2"><span class="section-number-4">1.5.2</span> Answer</h4>
<div class="outline-text-4" id="text-1-5-2">
<p>
The procedure <code>p</code> will cause an infinitely recursive loop if
executed. If Ben is using an applicative-order interpreter, the
operands will be evaluated first, and the command will enter the loop.
If the interpreter is normal order, the value of the operands will not
be resolved immediately. Instead, test will be executed. <code>x</code> will be
resolved in the predicate of the <code>if</code>, which succeeds. As the consequent
branch is followed, <code>y</code> will never be evaluated, and thus <code>p</code> will never
be executed.
</p>

<p>
To clarify the difference between normal and applicative order,
consider nested applications of the <code>sq</code> procedure:
</p>

<pre class="example">
(define (sq n) (* n n)
(sq (sq (sq (+ 1 1))))
</pre>

<p>
Suppose this is evaluated in normal order (combining some of the
expansion steps to save space):
</p>

<pre class="example">
1&gt; (sq (sq (sq (+ 1 1))))
2&gt; (* (sq (sq (+ 1 1)))
      (sq (sq (+ 1 1))))
3&gt; (* (* (sq (+ 1 1))
         (sq (+ 1 1))
      (* (sq (+ 1 1))
         (sq (+ 1 1)))
4&gt; (* (* (* (+ 1 1) (+ 1 1))
         (* (+ 1 1) (+ 1 1)))
      (* (* (+ 1 1) (+ 1 1))
         (* (+ 1 1) (+ 1 1))))
5&gt; (* (* (* 2 2) (* 2 2))
      (* (* 2 2) (* 2 2)))
6&gt; (* (* 4 4) (* 4 4)
7&gt; (* 16 16)
8&gt; 256
</pre>

<p>
As can be seen, none of the "leaf" additions are evaluated until
everything is expanded, so there are eight individual addition and
seven multiplication operations performed (as seen in steps 4 through
7). Compare this to an applicative-order evaluation:
</p>

<pre class="example">
1&gt; (sq (sq (sq (+ 1 1))))
2&gt; (sq (sq (sq 2)))
3&gt; (sq (sq (* 2 2)))
4&gt; (sq (sq 4))
5&gt; (sq (* 4 4))
6&gt; (sq 16)
7&gt; (* 16 16)
8&gt; 256
</pre>

<p>
Only a single addition and three multiplications need to be performed!
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Section 1.1.7</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Exercise 1.6: <code>if</code> and the reason for special forms</h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> Problem</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
Alyssa P. Hacker doesn't see why <code>if</code> needs to be
provided as a special form.  "Why can't I just define it as an
ordinary procedure in terms of <code>cond?</code>," she asks.  Alyssa's friend
Eva Lu Ator claims this can indeed be done, and she defines a new
version of <code>if</code>:
</p>

<pre class="example">
(define (new-if predicate then-clause else-clause)
  (if predicate
      then-clause
      else-clause))
</pre>

<p>
Eva demonstrates the program for Alyssa:
</p>

<pre class="example">
(new-if (= 2 3) 0 5)
5

(new-if (= 1 1) 0 5)
0
</pre>

<p>
Delighted, Alyssa uses <code>new-if</code> to rewrite the square-root program:
</p>

<pre class="example">
(define (sqrt-iter guess x)
  (new-if (good-enough? guess x)
          guess
          (sqrt-iter (improve guess x)
                     x)))

(sqrt-iter 1 4)

(if true
        guess
        (sqrt-iter (improve guess x)
                   x))


(new-if true
        guess
        (sqrt-iter (improve guess x)
                   x))
(new-if (good-enough? guess x)
        guess
        (new-if (good-enough? guess x)
                guess
                (sqrt-iter (improve guess x)
                           x)))
</pre>

<p>
What happens when Alyssa attempts to use this to compute square
roots?  Explain.
</p>
</div>
</div>
<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> Answer</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
In <code>sqrt-iter</code>, before <code>new-if</code> is called, the arguments are evaluated
in applicative order. This includes the recursive call to
itself. Thus, even when the good-enough? termination condition is
satisfied, the recursion will continue, resulting in an infinite
recursion.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Exercise 1.7: When <code>good-enough?</code> is not good enough</h3>
