exercises-1.1.tex
Ben Bitdiddle has invented a test to determine whether the
interpreter he is faced with is using applicative-order
evaluation or normal-order evaluation.  He defines the following
two procedures:

\begin{verbatim}
(define (p) (p))

(define (test x y)
  (if (= x 0)
      0
      y))
\end{verbatim}

Then he evaluates the expression

\begin{verbatim}
(test 0 (p))
\end{verbatim}

What behavior will Ben observe with an interpreter that uses
applicative-order evaluation?  What behavior will he observe with
an interpreter that uses normal-order evaluation?  Explain your
answer.  (Assume that the evaluation rule for the special form
`if' is the same whether the interpreter is using normal or
applicative order: The predicate expression is evaluated first,
and the result determines whether to evaluate the consequent or
the alternative expression.)
\item Answer
\label{sec-1-1-5-2}

The procedure \texttt{p} will cause an infinitely recursive loop if
executed. If Ben is using an applicative-order interpreter, the
operands will be evaluated first, and the command will enter the loop.
If the interpreter is normal order, the value of the operands will not
be resolved immediately. Instead, test will be executed. \texttt{x} will be
resolved in the predicate of the \texttt{if}, which succeeds. As the consequent
branch is followed, \texttt{y} will never be evaluated, and thus \texttt{p} will never
be executed.

To clarify the difference between normal and applicative order,
consider nested applications of the \texttt{sq} procedure:

\begin{verbatim}
(define (sq n) (* n n)
(sq (sq (sq (+ 1 1))))
\end{verbatim}

Suppose this is evaluated in normal order (combining some of the
expansion steps to save space):

\begin{verbatim}
1> (sq (sq (sq (+ 1 1))))
2> (* (sq (sq (+ 1 1)))
      (sq (sq (+ 1 1))))
3> (* (* (sq (+ 1 1))
         (sq (+ 1 1))
      (* (sq (+ 1 1))
         (sq (+ 1 1)))
4> (* (* (* (+ 1 1) (+ 1 1))
         (* (+ 1 1) (+ 1 1)))
      (* (* (+ 1 1) (+ 1 1))
         (* (+ 1 1) (+ 1 1))))
5> (* (* (* 2 2) (* 2 2))
      (* (* 2 2) (* 2 2)))
6> (* (* 4 4) (* 4 4)
7> (* 16 16)
8> 256
\end{verbatim}

As can be seen, none of the "leaf" additions are evaluated until
everything is expanded, so there are eight individual addition and
seven multiplication operations performed (as seen in steps 4 through
7). Compare this to an applicative-order evaluation:

\begin{verbatim}
1> (sq (sq (sq (+ 1 1))))
2> (sq (sq (sq 2)))
3> (sq (sq (* 2 2)))
4> (sq (sq 4))
5> (sq (* 4 4))
6> (sq 16)
7> (* 16 16)
8> 256
\end{verbatim}

Only a single addition and three multiplications need to be performed!
\end{enumerate}
\subsection{Section 1.1.7}
\label{sec-1-2}
\subsubsection{Exercise 1.6: \texttt{if} and the reason for special forms}
\label{sec-1-2-1}
\begin{enumerate}
\item Problem
\label{sec-1-2-1-1}

Alyssa P. Hacker doesn't see why \texttt{if} needs to be
provided as a special form.  "Why can't I just define it as an
ordinary procedure in terms of \texttt{cond?}," she asks.  Alyssa's friend
Eva Lu Ator claims this can indeed be done, and she defines a new
version of \texttt{if}:

\begin{verbatim}
(define (new-if predicate then-clause else-clause)
  (cond (predicate then-clause)
        (else else-clause)))
\end{verbatim}

Eva demonstrates the program for Alyssa:

\begin{verbatim}
(new-if (= 2 3) 0 5)
5

(new-if (= 1 1) 0 5)
0
\end{verbatim}

Delighted, Alyssa uses \texttt{new-if} to rewrite the square-root program:

\begin{verbatim}
(define (sqrt-iter guess x)
  (new-if (good-enough? guess x)
          guess
          (sqrt-iter (improve guess x)
                     x)))
\end{verbatim}

What happens when Alyssa attempts to use this to compute square
roots?  Explain.
\item Answer
\label{sec-1-2-1-2}

In \texttt{sqrt-iter}, before \texttt{new-if} is called, the arguments are evaluated
in applicative order. This includes the recursive call to
itself. Thus, even when the good-enough? termination condition is
satisfied, the recursion will continue, resulting in an infinite
recursion.
\end{enumerate}
\subsubsection{Exercise 1.7: When \texttt{good-enough?} is not good enough}
\label{sec-1-2-2}
\begin{enumerate}
\item Problem
\label{sec-1-2-2-1}
