exercises-1.1.org
*** Problem

    The =good-enough?= test used in computing square roots will not
    be very effective for finding the square roots of very small
    numbers.  Also, in real computers, arithmetic operations are
    almost always performed with limited precision.  This makes our
    test inadequate for very large numbers.  Explain these
    statements, with examples showing how the test fails for small
    and large numbers.  An alternative strategy for implementing
    =good-enough?= is to watch how =guess= changes from one iteration
    to the next and to stop when the change is a very small fraction
    of the guess.  Design a square-root procedure that uses this kind
    of end test.  Does this work better for small and large numbers?

*** Answer
#+BEGIN_SRC scheme :session 1-1-7 :results silent
  (define (sqrt-iter guess x)
    (if (good-enough? guess x)
        guess
        (sqrt-iter (improve guess x)
                   x)))

  (define (improve guess x)
    (average guess (/ x guess)))

  (define (average x y)
    (/ (+ x y) 2))

  (define (good-enough? guess x)
    (< (abs (- (square guess) x)) 0.001))

  (define (sqrt1 x)
    (sqrt-iter 1.0 x))

  (define (percent-changed new old)
    (/ (- new old) old))

  (define (small-change? new-guess old-guess)
    (< (abs (percent-changed new-guess old-guess)) 0.001))

  (define (sqrt-scaled x)
    (define (sqrt-iter-scaled current-guess last-guess x)
      (if (smallest-divisor small-change? current-guess last-guess)
          current-guess
          (sqrt-iter-scaled (improve current-guess x)
                            current-guess x)))
    (sqrt-iter-scaled 1.0 100.0 x))

  (define sqrt sqrt-scaled)
#+END_SRC

Checking the results:

#+BEGIN_SRC scheme
(sqrt 10000000.0)        ; Racket's built-in
(sqrt1 10000000.0)       ; Version from text
(sqrt-scaled 10000000.0) ; Scale-sensitive version
#+END_SRC

#+BEGIN_example
> (sqrt 10000000.0)        ; Racket's built-in
3162.2776601683795
> (sqrt1 10000000.0)       ; Version from text
3162.277660168379
> (sqrt-scaled 10000000.0) ; Scale-sensitive version
3162.277666486375
#+END_example

As can be seen the scale sensitive version does not perform as well at
large scales (as the iterative steps are larger, it is somewhat easier
to satisfy the =small-change?= predicate.

#+BEGIN_example
> (sqrt 0.00000001)
0.0001
> (sqrt1 0.00000001)
0.03125010656242753
> (sqrt-scaled 0.00000001)
0.00010000000000082464
#+END_example

The value of this version becomes evident at very small scales.  The
original version from the text is more easily satisfied in this case,
as the improvement steps are so tiny.

** Exercise 1.8
*** Problem

    Newton's method for cube roots is based on the fact that if $y$ is
    an approximation to the cube root of $x$, then a better
    approximation is given by the value

    $$ \frac{x/y^2 + 2y}{3} $$

    Use this formula to implement a cube-root procedure analogous to
    the square-root procedure.  (In section 1.3.4we will see how to
    implement Newton's method in general as an abstraction of these
    square-root and cube-root procedures.)

*** Answer

Extending to cube roots is straightforward. Building on the code in the last
exercise:

#+BEGIN_SRC scheme :session 1-1-7
(define (cube x)
  (* x x x))

(define (improve-cubic-guess guess x)
  (average guess (/ (+ (/ x (square guess)) (* 2 guess)) 3)))

(define (cbrt-iter-scaled current-guess last-guess x)
  (if (small-change? current-guess last-guess)
      current-guess
      (cbrt-iter-scaled (improve-cubic-guess current-guess x) current-guess x)))

(define (cbrt x)
  (cbrt-iter-scaled 1.0 100.0 x))
#+END_SRC

#+RESULTS:

This gives results that do indeed look like an approximation to the
cubic root of a number. Comparing against the results of the Racket
=expt= function:

#+BEGIN_example
> (cbrt 27)
3.0018696341051916
> (expt 27 1/3)
3.0

> (cbrt 1000)
10.009419213708078
> (expt 1000 1/3)
9.999999999999998

> (cbrt 100000000)
464.61792889946435
> (expt 100000000 1/3)
464.15888336127773

> (cbrt 0.0000001)
0.004645991760883334
> (expt 0.0000001 1/3)
0.00464158883361278
#+END_example
