exercises-1.1.html
<div class="outline-text-3" id="text-2-2">
</div><div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> Problem</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
The <code>good-enough?</code> test used in computing square roots will not
be very effective for finding the square roots of very small
numbers.  Also, in real computers, arithmetic operations are
almost always performed with limited precision.  This makes our
test inadequate for very large numbers.  Explain these
statements, with examples showing how the test fails for small
and large numbers.  An alternative strategy for implementing
<code>good-enough?</code> is to watch how <code>guess</code> changes from one iteration
to the next and to stop when the change is a very small fraction
of the guess.  Design a square-root procedure that uses this kind
of end test.  Does this work better for small and large numbers?
</p>
</div>
</div>
<div id="outline-container-sec-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4">2.2.2</span> Answer</h4>
<div class="outline-text-4" id="text-2-2-2">
<div class="org-src-container">

<pre class="src src-scheme">(define (sqrt-iter guess x)
  (if (good-enough? guess x)
      guess
      (sqrt-iter (improve guess x)
                 x)))

(define (improve guess x)
  (average guess (/ x guess)))

(define (average x y)
  (/ (+ x y) 2))

(define (good-enough? guess x)
  (&lt; (abs (- (square guess) x)) 0.001))

(define (sqrt1 x)
  (sqrt-iter 1.0 x))

(define (percent-changed new old)
  (/ (- new old) old))

(define (small-change? new-guess old-guess)
  (&lt; (abs (percent-changed new-guess old-guess)) 0.001))

(define (sqrt-scaled x)
  (define (sqrt-iter-scaled current-guess last-guess x)
    (if (smallest-divisor small-change? current-guess last-guess)
        current-guess
        (sqrt-iter-scaled (improve current-guess x)
                          current-guess x)))
  (sqrt-iter-scaled 1.0 100.0 x))

(define sqrt sqrt-scaled)
</pre>
</div>

<p>
Checking the results:
</p>

<div class="org-src-container">

<pre class="src src-scheme">(sqrt 10000000.0)        ; Racket's built-in
(sqrt1 10000000.0)       ; Version from text
(sqrt-scaled 10000000.0) ; Scale-sensitive version
</pre>
</div>

<pre class="example">
&gt; (sqrt 10000000.0)        ; Racket's built-in
3162.2776601683795
&gt; (sqrt1 10000000.0)       ; Version from text
3162.277660168379
&gt; (sqrt-scaled 10000000.0) ; Scale-sensitive version
3162.277666486375
</pre>

<p>
As can be seen the scale sensitive version does not perform as well at
large scales (as the iterative steps are larger, it is somewhat easier
to satisfy the <code>small-change?</code> predicate.
</p>

<pre class="example">
&gt; (sqrt 0.00000001)
0.0001
&gt; (sqrt1 0.00000001)
0.03125010656242753
&gt; (sqrt-scaled 0.00000001)
0.00010000000000082464
</pre>

<p>
The value of this version becomes evident at very small scales.  The
original version from the text is more easily satisfied in this case,
as the improvement steps are so tiny.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Exercise 1.8</h3>
<div class="outline-text-3" id="text-2-3">
</div><div id="outline-container-sec-2-3-1" class="outline-4">
<h4 id="sec-2-3-1"><span class="section-number-4">2.3.1</span> Problem</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
Newton's method for cube roots is based on the fact that if \(y\) is
an approximation to the cube root of \(x\), then a better
approximation is given by the value
</p>

<p>
$$ \frac{x/y^2 + 2y}{3} $$
</p>

<p>
Use this formula to implement a cube-root procedure analogous to
the square-root procedure.  (In section 1.3.4we will see how to
implement Newton's method in general as an abstraction of these
square-root and cube-root procedures.)
</p>
</div>
</div>
<div id="outline-container-sec-2-3-2" class="outline-4">
<h4 id="sec-2-3-2"><span class="section-number-4">2.3.2</span> Answer</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
Extending to cube roots is straightforward. Building on the code in the last
exercise:
</p>

<div class="org-src-container">

<pre class="src src-scheme">(define (cube x)
  (* x x x))

(define (improve-cubic-guess guess x)
  (average guess (/ (+ (/ x (square guess)) (* 2 guess)) 3)))

(define (cbrt-iter-scaled current-guess last-guess x)
  (if (small-change? current-guess last-guess)
      current-guess
      (cbrt-iter-scaled (improve-cubic-guess current-guess x) current-guess x)))

(define (cbrt x)
  (cbrt-iter-scaled 1.0 100.0 x))
</pre>
</div>

<p>
This gives results that do indeed look like an approximation to the
cubic root of a number. Comparing against the results of the Racket
<code>expt</code> function:
</p>

<pre class="example">
&gt; (cbrt 27)
3.0018696341051916
&gt; (expt 27 1/3)
3.0

&gt; (cbrt 1000)
10.009419213708078
&gt; (expt 1000 1/3)
9.999999999999998

&gt; (cbrt 100000000)
464.61792889946435
&gt; (expt 100000000 1/3)
464.15888336127773

&gt; (cbrt 0.0000001)
0.004645991760883334
&gt; (expt 0.0000001 1/3)
0.00464158883361278
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Paul L. Snyder</p>
<p class="date">Created: 2014-03-30 Sun 19:30</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.50.1 (<a href="http://orgmode.org">Org</a> mode 8.2.5h)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
