exercises-1.1.tex

The \texttt{good-enough?} test used in computing square roots will not
be very effective for finding the square roots of very small
numbers.  Also, in real computers, arithmetic operations are
almost always performed with limited precision.  This makes our
test inadequate for very large numbers.  Explain these
statements, with examples showing how the test fails for small
and large numbers.  An alternative strategy for implementing
\texttt{good-enough?} is to watch how \texttt{guess} changes from one iteration
to the next and to stop when the change is a very small fraction
of the guess.  Design a square-root procedure that uses this kind
of end test.  Does this work better for small and large numbers?
\item Answer
\label{sec-1-2-2-2}
\begin{verbatim}
(define (sqrt-iter guess x)
  (if (good-enough? guess x)
      guess
      (sqrt-iter (improve guess x)
                 x)))

(define (improve guess x)
  (average guess (/ x guess)))

(define (average x y)
  (/ (+ x y) 2))

(define (good-enough? guess x)
  (< (abs (- (square guess) x)) 0.001))

(define (sqrt1 x)
  (sqrt-iter 1.0 x))

(define (percent-changed new old)
  (/ (- new old) old))

(define (small-change? new-guess old-guess)
  (< (abs (percent-changed new-guess old-guess)) 0.001))

(define (sqrt-iter-scaled current-guess last-guess x)
  (if (small-change? current-guess last-guess)
      current-guess
      (sqrt-iter-scaled (improve current-guess x) current-guess x)))

(define (sqrt-scaled x)
  (sqrt-iter-scaled 1.0 100.0 x))
\end{verbatim}

Checking the results:

\begin{verbatim}
(sqrt 10000000.0)        ; Racket's built-in
(sqrt1 10000000.0)       ; Version from text
(sqrt-scaled 10000000.0) ; Scale-sensitive version
\end{verbatim}

\begin{verbatim}
> (sqrt 10000000.0)        ; Racket's built-in
3162.2776601683795
> (sqrt1 10000000.0)       ; Version from text
3162.277660168379
> (sqrt-scaled 10000000.0) ; Scale-sensitive version
3162.277666486375
\end{verbatim}

As can be seen the scale sensitive version does not perform as well at
large scales (as the iterative steps are larger, it is somewhat easier
to satisfy the \texttt{small-change?} predicate.

\begin{verbatim}
> (sqrt 0.00000001)
0.0001
> (sqrt1 0.00000001)
0.03125010656242753
> (sqrt-scaled 0.00000001)
0.00010000000000082464
\end{verbatim}

The value of this version becomes evident at very small scales.  The
original version from the text is more easily satisfied in this case,
as the improvement steps are so tiny.
\end{enumerate}
\subsubsection{Exercise 1.8}
\label{sec-1-2-3}
\begin{enumerate}
\item Problem
\label{sec-1-2-3-1}

Newton's method for cube roots is based on the fact that if $y$ is
an approximation to the cube root of $x$, then a better
approximation is given by the value

$$ \frac{x/y^2 + 2y}{3} $$

Use this formula to implement a cube-root procedure analogous to
the square-root procedure.  (In section 1.3.4we will see how to
implement Newton's method in general as an abstraction of these
square-root and cube-root procedures.)
\item Answer
\label{sec-1-2-3-2}

Extending to cube roots is straightforward. Building on the code in the last
exercise:

\begin{verbatim}
(define (cube x)
  (* x x x))

(define (improve-cubic-guess guess x)
  (average guess (/ (+ (/ x (square guess)) (* 2 guess)) 3)))

(define (cbrt-iter-scaled current-guess last-guess x)
  (if (small-change? current-guess last-guess)
      current-guess
      (cbrt-iter-scaled (improve-cubic-guess current-guess x) current-guess x)))

(define (cbrt x)
  (cbrt-iter-scaled 1.0 100.0 x))
\end{verbatim}

This gives results that do indeed look like an approximation to the
cubic root of a number. Comparing against the results of the Racket
\texttt{expt} function:

\begin{verbatim}
> (cbrt 27)
3.0018696341051916
> (expt 27 1/3)
3.0

> (cbrt 1000)
10.009419213708078
> (expt 1000 1/3)
9.999999999999998

> (cbrt 100000000)
464.61792889946435
> (expt 100000000 1/3)
464.15888336127773

> (cbrt 0.0000001)
0.004645991760883334
> (expt 0.0000001 1/3)
0.00464158883361278
\end{verbatim}
\end{enumerate}
% Emacs 24.3.50.1 (Org mode 8.2.5h)
\end{document}
